### Pandas-DataFrame And Series

Pandas is a powerful data manipulation library in python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes(rows and columns)

In [2]:
import pandas as pd

In [3]:
## Series
## 1D array like object that can hold any data type.

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
## Create Series From Dictionary 
data={'a':1, 'b':2, 'c':3}
series=pd.Series(data)
print(series)

a    1
b    2
c    3
dtype: int64

In [5]:
## Give different index for my requirement
data=[10,20,30]
index=['a', 'b', 'c']
pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [23]:
## Data Frame
## create a DataFrame from a dictionary of list

data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Banglore', 'New York', 'Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New York
2   Jack   45   Florida
<class 'pandas.core.frame.DataFrame'>

In [24]:
import numpy as np
np.array(df)

array([['Krish', 25, 'Banglore'],
       ['John', 30, 'New York'],
       ['Jack', 45, 'Florida']], dtype=object)

In [17]:
## Create a Data frame from a List of Dictionaries

data=[
    {'Name':'Krish','Age': 32, 'City':'Banglore'},
    {'Name':'Krish','Age': 32, 'City':'Banglore'},
    {'Name':'Krish','Age': 32, 'City':'Banglore'},
    {'Name':'Krish','Age': 32, 'City':'Banglore'},
    ]

df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  Krish   32  Banglore
1  Krish   32  Banglore
2  Krish   32  Banglore
3  Krish   32  Banglore
<class 'pandas.core.frame.DataFrame'>

In [42]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [19]:
df.tail(5)  # last 5 records

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [20]:
### Accessing Data From Dataframe

df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [26]:
df['Name'] # Access column
type(df['Name'])

pandas.core.series.Series

In [27]:
df.loc[0]

Name       Krish
Age           25
City    Banglore
Name: 0, dtype: object

In [28]:
df.iloc[0][0]

C:\Users\kavy1\AppData\Local\Temp\ipykernel_30640\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Krish'

In [29]:
df.iloc[0][2]

C:\Users\kavy1\AppData\Local\Temp\ipykernel_30640\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Banglore'

In [30]:
## Accessing a specified element
df['Age']

0    25
1    30
2    45
Name: Age, dtype: int64

In [31]:
print(df.at[1,'Age'])

30

In [32]:
## Accessing a specified element using iat
df.iat[2,2]

'Florida'

In [33]:
### Data Manipulation with DataFrame
df

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New York
2   Jack   45   Florida

In [34]:
## Add a column
df['Salary']=[50000, 60000, 70000]
df

    Name  Age      City  Salary
0  Krish   25  Banglore   50000
1   John   30  New York   60000
2   Jack   45   Florida   70000

In [35]:
## Remove a column
df.drop('Salary', axis=1) # doesnot permanbently remove column temprory deletion

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New York
2   Jack   45   Florida

In [36]:
df

    Name  Age      City  Salary
0  Krish   25  Banglore   50000
1   John   30  New York   60000
2   Jack   45   Florida   70000

In [37]:
df.drop('Salary', axis=1, inplace=True) ## add inplace for permanent column deletion

In [38]:
df

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New York
2   Jack   45   Florida

In [39]:
## Add age to the column
df['Age']=df['Age']+1
df

    Name  Age      City
0  Krish   26  Banglore
1   John   31  New York
2   Jack   46   Florida

In [40]:
df.drop(0, inplace=True)
df

   Name  Age      City
1  John   31  New York
2  Jack   46   Florida

In [44]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000